#Варіант 12
import pandas as pd

#Створюємо словник cars
cars = {
    "Car1": {"вартість": 15000, "вік": 5},
    "Car2": {"вартість": 20000, "вік": 8},
    "Car3": {"вартість": 18000, "вік": 3},
    "Car4": {"вартість": 22000, "вік": 7},
    "Car5": {"вартість": 16000, "вік": 4},
    "Car6": {"вартість": 25000, "вік": 8},
    "Car7": {"вартість": 17000, "вік": 4},
    "Car8": {"вартість": 23000, "вік": 6},
    "Car9": {"вартість": 19000, "вік": 7},
    "Car10": {"вартість": 21000, "вік": 7}
}

df = pd.DataFrame(cars).T #Створюємо датафрейм з словника cars

print(f"Датафрейм cars: \n\n{df}")

#Отримуємо середнє значення та суму значень оцінок для стовпця "вартість"
mean_cost = df["вартість"].mean()
sum_cost = df["вартість"].sum()

print("\nАгрегація даних: ")
print(f"Середнє значення вартості: {mean_cost}$")
print(f"Сума вартості: {sum_cost}$")

grouped_by_age = df.groupby("вік").size().reset_index(name = "кількість автомобілів за віком") #Групуємо дані за віком

print(f"\nГрупування за віком: \n\n{grouped_by_age}")