#Варіант 12

start_list = input("Заповніть список значеннями через пробіл: ").split() #Вводимо список розділений пробілами
elements_to_replace = input("Введіть елементи для вставки через пробіл: ").split() #Вводимо елементи для вставки розділені пробілами

index = 0

#Перебираємо кожен елемент введеного списку
for i in range(len(start_list)):
    if index % 2 == 1 and elements_to_replace: #Перевіряємо, чи поточний індекс є непарним та чи є елементи для вставки
        start_list[i] = elements_to_replace.pop(0) #Вставляємо елемент зі списку для вставки
    index += 1

print(f"\nРезультат вставки нових елементів на непарні позиції в списку: \n{start_list}")